OdStepModelContext.setBrepParams(OdBrepParams)
\details
Sets new brep parameters for the model context.
\param params [in] Solid modeler parameters to be set.

OdStepModelContext.removeHiddenObjectId(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Removes hidden object from list.
\param id [in] An id of removed hidden object.
\returns Returns True if remove is successful; otherwise False.

OdStepModelContext.checkHiddenObject(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks if an object is marked as hidden.
\param id [in] An id of checked object.
\returns Returns True if an object is hidden; otherwise False.

OdStepModelContext.addHiddenObjectsId(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Adds new hidden object.
\param id [in] An id of new hidden object.

OdStepModelContext.checkSkipComposeId(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the specified identifier belongs to an object for which the compose operation will be skipped.
\param id [in] Identifier to check.
\returns true if the specified identifier belongs to an object for which the compose operation will be skipped; otherwise the method returns false.

OdStepModelContext.setSkipComposeIds(OdArray&lt;OdDAIObjectId,OdObjectsAllocator&lt;OdDAIObjectId&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Specifies identifiers of objects for which the compose operation will be skipped.
\param notComposeContext [in] Array of object Ids for which the compose operation will be skipped.

OdStepModelContext.setDefaultEntityColor(OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new default model color.
\param color [in] An instance of the OdCmEntityColor object that represents the new default color.

OdStepModelContext.getDefaultEntityColor
\details
Retrieves the current default model color.
\returns Returns an instance of the OdCmEntityColor object that contains the current default color for the model.

OdStepModelContext.setDeviationParams(OdDeviationParams)
\details
Sets new deviation parameters for the model context.
\param params [in] Deviation parameters to be set.

OdStepModelContext.Dispose
\details
Virtual destructor.

OdStepModelContext.#ctor(OdDeviationParams,OdCmEntityColor)
\details
Creates a new model context object with specified deviation parameters and color.
\param params [in] Deviation parameters.
\param color  [in] Default model color value.

OdStepModelContext
\details
A class that implements working with an STEP model context.